# CanElementsBeDisplaced Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisplacementElement..::..CanElementsBeDisplaced Method
DisplacementElement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanElementsBeDisplaced(View, ICollection<(Of <<'(ElementId>)>>)) | Indicates if elements can be assigned to a new DisplacementElement. |
| CanElementsBeDisplaced(View, ICollection<(Of <<'(ElementId>)>>), ElementId%) | Indicates if elements can be assigned to a new DisplacementElement. |

# See Also
DisplacementElement Class
DisplacementElement Members
Autodesk.Revit.DB Namespace